Polish BookRealm public documentation
